app/controllers/galleries_controller.rb

  def create
    @gallery = current_user.galleries.build(gallery_params)

    if @gallery.save
---
INSERT INTO "galleries" ("title", "description", "user_id", "status", "views_count", "likes_count", "photos_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @gallery.update(gallery_params)
---
UPDATE "galleries" SET "title" = $1, "updated_at" = $2 WHERE "galleries"."id" = $3  [["title", "Updated Title"], ["updated_at", "2025-08-25 22:22:04.518369"], ["id", 21]]

  def destroy
    @gallery.destroy
---
DELETE FROM "galleries" WHERE "galleries"."id" = $1  [["id", 25]]

  def set_gallery
    @gallery = Gallery.find(params[:id])
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]