app/views/galleries/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
          <small class="text-muted">
            by <%= @gallery.user.first_name %> <%= @gallery.user.last_name %> •